tests/suite-1000-millis-sleep-test/6000-conc-200/ab_report.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.0.14 (be patient)


Server Software:        WEBrick/1.3.1
Server Hostname:        10.0.0.14
Server Port:            80

Document Path:          /sleep/1000
Document Length:        27 bytes

Concurrency Level:      200
Time taken for tests:   60.827 seconds
Complete requests:      6000
Failed requests:        0
Keep-Alive requests:    6000
Total transferred:      2172000 bytes
HTML transferred:       162000 bytes
Requests per second:    98.64 [#/sec] (mean)
Time per request:       2027.550 [ms] (mean)
Time per request:       10.138 [ms] (mean, across all concurrent requests)
Transfer rate:          34.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       5
Processing:  1116 2004 109.9   2011    2348
Waiting:     1116 2004 109.9   2011    2348
Total:       1119 2005 109.6   2011    2349

Percentage of the requests served within a certain time (ms)
  50%   2011
  66%   2014
  75%   2016
  80%   2017
  90%   2023
  95%   2030
  98%   2098
  99%   2237
 100%   2349 (longest request)